IDEA Open Model
BeamData.CrossSectionType Property
Compatible with IDEA StatiCa 20.1
 Type of cross section
 Namespace: IdeaRS.OpenModel.Connection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public string CrossSectionType { get; set; }
Public Property CrossSectionType As String
	Get
	Set
Property Value
Type: String
See Also
Reference
BeamData Class
IdeaRS.OpenModel.Connection Namespace